// Необходимо создать переменную в которой будет храниться температура в градусах Цельсия, преобразовать значение в температуру по фаренгейту.
// Формула перевода градусов Цельсия в градусы Фаренгейта: градусы Фаренгейта = (9 / 5) * градусы Цельсия + 32
// Вывести в консоль температуру в Цельсиях и Фаренгейтах.

let temperatureCelsius = 30;
let temperatureFahrenheit = (9 / 5) * temperatureCelsius + 32;
console.log(`Температура в цельсиях: ${temperatureCelsius} градусов`);
console.log(`Температура по фаренгейту: ${temperatureFahrenheit} градусов`);